src/test/resources/signed-body.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" SOAP-ENV:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-3a84ff56-56a5-4b1c-a7a4-39bf1b5172dd"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="SOAP-ENV xsd xsi"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-609871bb-b6a4-43c0-9767-9378bdcfdf27"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd xsi"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>1so5izTxmpv1BYnBK7KcEA9QIg4=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>siecYMUrBeqWP9cpXTpDYpSVKWjefl08EbWiazZrO3LaXQ5wUAr15+HkCBEAV0PvyOPnN3s6+qDHTDTpIA/lmnEWoj458ygh4LBK3SujEAZ980d2OYl2mQ6eS9CFWHIk305oz5EX69fMlhTfKbLUUoiln0V3Z+15k1zQZ5rMSy1IFY7EfpR5Jcm/9A66pvCrgcTFKA9V+AOjFKvJKR4AZC8m4/c7W4PZljvpA4PetCjoYp84LQgA0YeQ1KkJJWz6Dnxt583GxVgYMo064pYwJtfUuWoPVLPxMOYXK3ycv0c653xYv6OtmCxesTaifu4YbUf+H/fO9R0104DOnEEgbQ==</ds:SignatureValue><ds:KeyInfo Id="KI-0b373527-017c-4a8c-902b-34706e91f9cc"><wsse:SecurityTokenReference wsu:Id="STR-40b22209-c758-449e-a63b-93028123e12b" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=wssecurity,OU=preprocessor,O=jmeter</ds:X509IssuerName><ds:X509SerialNumber>1487469814</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></SOAP-ENV:Header>
    <SOAP-ENV:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-609871bb-b6a4-43c0-9767-9378bdcfdf27">
        <add xmlns="http://ws.apache.org/counter/counter_port_type">
            <value xmlns="">15</value>
        </add>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
